Repository: seanpm2001/mt-training-data
Catalog: nso/nso_pontoon.tmx
Source language: en_us
Languages: nso

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
nso: Re bala diiri ka go akanyetša palogare botelele bja rekhoto ye nngwe le ye nngwe, ke moka re atiša palo yeo ka kakaretšo ya direkhoto malemeng ka moka.

source: We could not fetch the stats. Please try again later.
nso: Ga se re kgone go lata dipalo-palo. Re kgopela o leke gape ka morago.

source: We couldn’t find that page for you
nso: Ga se re hwetše letlakala leo

source: We couldn’t get any audio clips for you to listen to. Please try again later.
nso: Re paletšwe ke go hwetša dipego tša odio tše o ka di theeletšago. Re kgopela o leke gape ka morago.

source: We couldn’t get any sentences for you to speak. Please try again later.
nso: Ga se re kgone go hwetša mafoko a o ka wa bolelago. Re kgopela o leke gape ka morago.

source: Weekly
nso: Beke le beke

source: Weekly Goal
nso: Pakane ya Beke

source: We failed to fetch available languages. Contributions are currently not possible. Please try again later.
nso: Re paletšwe ke go lata maleme a lego gona. Ga go kgonagale go neela gabjale. Re kgopela o leke gape mankgapela.

source: We launch the Common Voice site in this language.
nso: Re thomile saete ya Common Voice ka polelo ye.

source: Welcome { $company } staff!
nso: Rea go amogela { $company } bašomi!

source: Welcome to Common Voice
nso: Rea go amogela go Common Voice

source: Welcome to the Common Voice Sentence Collector
nso: Re ya go amogela go Molekgetho wa Mafoko ya Common Voice

source: Welsh
nso: Se-Welsh

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
nso: Re ka be re sa hwetša kgopelo yeo. Ka kgopelo re romele e-meile go lebanya le rena go <emailLink>{ $email }</emailLink> re tla boela go wena!

source: We prefer natural/conversational sentences. While phonetic diversity and different words in sentences is important, we are trying to make recording sentences as much fun as possible. Therefore it would be great if you could try to keep your sentences as natural/engaging as possible.
nso: Re kgetha mafoko a tlhago/poledišano. Lege phapano ya sefonetiki le mantšu a fapanego mafokong a bohlokwa, re leka go dira gore mafoko a go gatišwa di be bose kudu ka moo re ka kgonago. Ka gona go ka ba monate ge o ka leka go boloka mafoko a gago a be a tlhago/kopanelago kamoo go ka kgonegalago.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
nso: Re tshepiša go swara tshedimošo ya gago ka šedi. Bala ka mo go oketšegilego <privacyLink>Tsebišo ya Sephiri</privacyLink>.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
nso: Re aga dathasete e bulegilego, ya go ba le dipolelo tše dintši ya mantšu a ka šomišago ke mang le mang go tlwaetša tirišo ye dumelang polelo.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
nso: Re nyakana le batho ba bantši ba tšwago mothopong o bulegilego wa mantšu. Neelana ka lentšu la gago, netefatša bonnete bja dikarolwana tša batho ba bangwe, dira gore dathasete e be kaone bakeng sa motho yo mongwe le yo mongwe.

source: We’re experiencing unexpected downtime
nso: Re lebeletšane le nako e sa letelwago.

source: We’re going out to get coffee.
nso: Re ilo go hwetša kofi.

source: We release the dataset every 3 months.
nso: Re ntšha dathasete ka morago ga dikgwedi tše dingwe le tše dingwe tše 3.

source: We're receiving a lot of traffic and are currently investigating the issues.
nso: Re hwetša pitlagano e ntši ebile re nyakišiša bothata bjo.

source: We’re sorry, your platform is not currently supported.
nso: Re maswabi, sethala se sa gago ga se se thekgwe ga bjale.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
nso: Re šomiša sedirišwa sa Mozilla se bitšwago <pontoonLink>Pontoon</pontoonLink> bakeng sa diphetolelo. Pontoon e na le dipolelo tše dintši, eupša ge e ba e se na ya gago o ka <pontoonRequestLink>kgopela gore polelo ya geno e tsenywe</pontoonRequestLink>. Ke moka, o dire gore polelo e hwetšegale modirong wa Common Voice, <githubRepoLink>kgopela polelo e mpsha go GitHub</githubRepoLink>. <localizationFragment>Bona diphetolelo tše oketšegilego mo saete</localizationFragment>.

source: We've run out of clips to validate in this language...
nso: Re feletšwe ke di pego tša go kgonthišiša ka polelo e...

source: We've run out of sentences to record in this language...
nso: Re feletšwe ke mafoko a gatiša pego ka polelo e...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
nso: Re nyaka gore mehlala ya polelo e be kaone go kwešiša mehuta e fapa-fapanego ya diboledi. Gore se se direge, lentšu la dathasete le swanetše go emela batho ba bantši ba fapanego.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
nso: Re nyaka gore dathasete ya Common Voice e bonagatše seka sa theetšwago temogo ya sefetošetšamantšung dingwalwa e tla kwala nageng, kamoo re nyaka mehuta e fapa-fapanego. Go tlaleletša ntle le diboledi tše dintši tša go fapana, dathasete e nago le odio yeo e fapanego e tla ruta temogo ya sefetošetšamantšung dingwalwa go berekišana le maemo a fapanego a lefase, go tloga bokamorago go bolela le lešata ka koloi. Ge feela o dikarolwana tša lentšu la gago le sa kwagale, le tla swanela go ba se se loketšego dathasete.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
nso: Re nyaka gore alkoritheme ya go ithuta ya motšhene e kgone go šoma le lešata le fapanego, ešita le mašata a magolo ao a ka amogelwago ge feela le sa go thibele go kwa mongwalo ka moka. Mmino wa bokamorago wa llela fase o LOKILE; mmino o wa godimo ka mo go lekanego go go thibela go kwa lentšu le lengwe le lengwe ga wa lokela.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
nso: Le rena re tla <strong>tsebiša moetapele wa badudi gore o na le kgahlego </strong>, gore ba go fe thekgo e oketšegilego goba tsebo e o ka e hlokago.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
nso: Re tla ikgokaganya le wena ka tsebišo e oketšegilego mabapi le gore o ka tsenya polelo ya gago go Common Voice kapejana.

source: We will be in touch with more information as it becomes available.
nso: Re tla ikgokaganya le wena ka tsebo e nngwe ge e ba gona.

source: We will not make your email public.
nso: Re ka se phatlalatše e-meile ya gago.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
nso: Re tla hlahloba kgopelo ya gago ya go tloša direkhoto tša lentšu la gago dathaseteng. Ge e ba kgopelo ya gago e amogetšwe, re tla ikgokaganya le bao ba taonelouteng dathasete gomme re tla ba kgopela gore le bona ba phumole direkhoto tša lentšu la gago.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
nso: Go ra go reng gore ga ke kgone go "Utolla boitsebišo" ka diboledi go dathasete ya Common Voice?

source: What is a language on Common Voice?
nso: Ke eng polelo go Common Voice?

source: What is Common Voice?
nso: Common Voice ke eng?

source: What issues are you experiencing with this sentence?
nso: Ke mathata a feng ao o lebelanego le wona ka lefoko le?

source: What kind of goal do you want to build?
nso: O nyaka go aga pakane e bjang?

source: What level of audio quality is required for a voice clip to be used in the dataset?
nso: Ke kgato efe ya khwalithi ya odio e nyakegago go pego ya lentšu gore e berekišwe go dathasete?

source: What’s inside the Common Voice dataset?
nso: Ke eng e leng ka gare ga dathasete ya Common Voice?

source: What's Public?
nso: Ke eng ya go Phatlalatšwa?

source: What’s the difference between Common Voice and Deep Speech?
nso: Phapano ke efe magareng a Common Voice le Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
nso: Ge modiriši a gana mananeo a lentšu le a boela Mothalading. Ge e ba go ganwa lekgetho la bobedi, mananeo a lentšu e išwa Clip Graveyard.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
nso: Ge o theeditše, hlahloba ka kelohloko gore na seo se gatišitšwego ke sona seo se ngwadilwego; gana ge e ba go na le diphošo tše nyenyane. <br />Diphošo tše di tlwaelegilego kudu di akaretša:

source: When will you release Common Voice data in other languages?
nso: Le tlo lokolla neng datha ya Common Voice ka dipolelo tše dingwe?

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
nso: Ge o kgopela dipego, re ya di bokanya ka gare ga faele ya ZIP e tee goba tše dintši. Mo ke dikgopelo tša gago tša nakong e fetilego.

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
nso: A tšwa kae <wikipediaLink>mafelong a batho bohle</wikipediaLink> mafoko a?

source: Where does the source text come from?
nso: Mothopo wa mangwalo a tšwa kae?

source: Which variant of { $language } do you speak?
nso: Ke se fe se swanego le{ $lang } se o se bolelago?

source: Why ?
nso: Go baneng?

source: Why a profile?
nso: Go baneng profaele?

source: Why Common Voice?
nso: Go baneng Common Voice?

source: Why does this matter?
nso: Ke ka baka la'ng e le bohlokwa?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
nso: Go baneng o sa kgopele batho ba bale tše tšwago dipukung goba di-athekele tša Wikipedia tša maleme a fapanego.

source: Why do you need so many different speakers per language?
nso: Ke ka baka la'ng o hloka diboledi tše dintši tše di fapanego bakeng sa polelo e nngwe le e nngwe?

source: Why is 10,000 validated hours the per language goal for capturing audio?
nso: Go baneng diiri tše 10,000 tše kgonthišitšwe e le pakane ya polelo ya go thopa di odio?

source: Why is Common Voice part of the Mozilla mission?
nso: Go baneng Common Voice e le karolo ya morero wa Mozilla?

source: Why is it important?
nso: Ke ka lebaka la'ng e le bohlokwa?

source: Why is my language not included yet?
nso: Go baneng polelo yaka e sa akaretšwa?

source: Why should I sign up for an account?
nso: Ke le baka la'ng la go ngwadiša akhaonto?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
nso: Na o ka rata go kgopela direkhoto tša lentšu la gago di phumolwe, goba o kgetha go di boloka go dathaseteng ya Common Voice?

source: Xhosa
nso: SeXhosa

source: Xitsonga
nso: Setsonga

source: Yes
nso: Ee

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
nso: Ee, romela di-emeile. Ke tla rata go boledišana le wena ka projeke ya Common Voice.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
nso: Ee, nromele di-emeile. ke tla rata go boledišana le lena mabapi le tšwelopele ya polelo mo go Common Voice.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
nso: Ee, ka go kgethega re nyaka lentšu la gago! Karolo ya boikemišetšo bja Common Voice ke go kgobokanetša mmelelo e mentši ya go fapa-fapana ka moo go ka kgonegago e le gore tlhathollo e amogetšwego ya lentšu e šoma gabotse go batho bohle. Seo se bolela gore meneelo e tšwago go diboledi tšeo di sego tša matswalo a moo a bohlokwa kudu.

source: Yiddish
nso: Se-Yiddish

source: Yoruba
nso: Se-Yoruba

source: You
nso: Wena

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
nso: O thoma tanelouto ya<size>{ $size }GB</size>, Re tšwele pele?

source: You are prepared to initiate a download of <b>{ $size }</b>
nso: O lokišetše go thoma ka tanelouto ya <b>{ $size }</b>

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
nso: O ka kopisa le go beya di-URL tše tobegilego go sesepetša digogwa wa gago o ratago. Di tla felelwa ke nako ka morago ga diiri tše 12, eupša o ka boela latlakaleng le go hlagiša tše di mpsha ka nako le ge e le efe.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
nso: O ka šomiša Dikgaoletše tša Khiipote: { sc-review-form-button-approve-shortcut } go Dumela { sc-review-form-button-reject-shortcut } go Gana { sc-review-form-button-skip-shortcut } go Tshela

source: You can choose to make your username public or anonymous.
nso: O ka kgetha go phatlaletša leina la mošomiši goba ya go se tsebje.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
nso: O ka ya go <datasetsPage>letlakaleng la di-dathasete</datasetsPage>, kgetha mohuta le (di)polelo tšeo o di nyakago, gomme o di taneloute! Difaele di na le <metadataLink>methadatha a linki</metadataLink>, bjalo ka tsebišo ya palo ya batho le datha e netefatšwego. O tla hloka go nea ka aterese ya e-meile go tanelouta dathasete.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
nso: O ka thuša go aga di dathasete tše di fapanego tša mothopo o bulegilego ka go hlangwa profaele ya Common Voice le go neela lentšu la gago.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
nso: O ka kopana le ba bangwe ba setšhaba sa polelo ya Mozilla ka go ikopanya go <discourseLink>Discourse</discourseLink> go hwetša poledišano ya ditaba, goba <matrixLink>Matrikse</matrixLink> go hwetša keletšo ya kapejana.

source: You cannot request your recordings while another request is already in progress.
nso: O ka se kgone go kgopela dikgatišo tša gago mola go nale tšeo di kgopetšego.

source: You can request a new takeout of your recordings every { $days } days.
nso: O ka kgopela go ntšha ga dikgatišo tša gago tše mpsha ka matšatši a mangwe le a mangwe a { $days }.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
nso: O ka tsamaiša ditiragalo go thuša batho go neela. Go bonolo go feta kamoo o naganago ka gona. O ka e dira inthaneteng ka go diriša lenaneo la bidio inthaneteng, goba motho ka nama ge e ba go bolokegile. <eventTemplate>Lebelela dithempleite tša rena le ditlabakelo tša go tsamaiša ditiragalo</eventTemplate>.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
nso: O ka <sentenceCollectorLinkAdd>oketša dipalo tše nyenyane tša mafoko</sentenceCollectorLinkAdd>, goba o ka <bulkImportDocsLink>tsenya bontši bja o diriša Github</bulkImportDocsLink>. Gopola gore mafoko ao a hloka go ba <licenseLink>CC0 (goba mafelong a setšhaba ka moka)</licenseLink>, goba o ka ngwala a gago.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
nso: O ka šomiša <scraperLink>leswao la kgaoganyo ya Lefoko</scraperLink> go šomiša mafoko a fokotšegilego a go tšwa go Wikipedia.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
nso: O ka akaretša wepesaete, e.g "Common Voice- https://commonvoice.mozilla.org/"

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
nso: O ka berikiša tshupišo ya thuto, e.g setaele sa Harvard "Mozilla (2021) Common Voice. E lego gona go https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
nso: O ka šomiša lekgotla la poledišano ya inthaneteng go kgona go iša molaetša go batho ka moka. Abelana melaetša e hlalosago gore na ke baka la eng go le bohlokwa, gomme o ikgokaganye le batho ba bangwe bao ba bolelago ka mathata a go swana le ditokelo tša polelo, lentšu la AI, goba tshekamelo go theknolotši. Bona dikeletšo tše dingwe mabapi le<campaignLink> go tsamaiša lesolo la setšhaba, go akaretša le diteng tšeo o ka di šomišago gape</campaignLink>.

source: You have not added any languages yet.
nso: Ga se o tsenye dipolelo tše dingwe.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
nso: Ga se o kgethe maleme lege e le lefe. <profileLink>Profile</profileLink> go kgetha maleme.

source: You must allow microphone access.
nso: O swanetše o dumelele go berikišwa ga maekrofone.

source: You previously skipped sentences while reviewing. Resetting skipped sentences will show all skipped sentences again. This is independent of the language.
nso: Nakong e fetilego o tshetše mafoko ge o dutše o hlahloba. Go setalefsa mafoko a fetilwego go tla bontšha mafoko ka moka a fetilwego. Se se ikemetše ka polelo.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
nso: Mmolelo wa gago ke tsela yeo o bitšago matšu ka gona. Seo se ka bopša ke moo o dutšego gona, dipolelo tše dingwe tšeo o di bolelago le dibopego tše dingwe. O ka abelana tsebišo le ge e le efe yeo o naganago gore e bohlokwa mo.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
nso: Dipego tša gago tša lentšu tšeo di sa tsebjego di tla šala go dathasete ya Common Voice. Ka morago ga go phumola profaele ya gago o ka sa kgona go romela kgopelo ya go phumola direkhoto tša gago go dathasete.

source: Your daily goal has been created
nso: Pakane ya gago ya letšatši e bopilwe

source: Your download has started.
nso: Tanelouto ya gago e thomile.

source: You’re contributing to a target segment
nso: O tlaleletša go karolo ya nepo

source: You’re contributing to our first target segment
nso: O tlaleletša go karolo ya nepo ya rena ya mathomo

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
nso: Gona bjale o <bold>GANA</bold> go hwetša lenaneo la poso la dikgopotšo tša dipakane, sebontšhatšwelopele le mangwalo a ditaba tša Common Voice

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
nso: Gona bjale o loketše go hwetša di-emeile tša go swana le dikgopotšo tša dipakane, sebontšhatšwelopele le mangwalo a ditaba tša Common Voice.

source: Your email address
nso: E-meile ya gago

source: Your files are being assembled. Please check again later.
nso: Difaele tša gago di ya kopantšwa. Re kgopela o lebelele gape ka morago.

source: Your languages:
nso: Maleme a Gago:

source: Your Languages
nso: Maleme a Geno

source: Your username and email will not be associated with the published data.
nso: Leina la gago la mošomiši le e-meile di ka se kopantšhwe le datha e re tlo e phatlalatša.

source: Your weekly goal has been created
nso: Pakane ya gago ya beke e hlangwe

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
nso: O tla hwetša e-meile ka moragonyana e hlalosago megato ya go tsenya polelo ya gago go Common Voice

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
nso: O thušitše Common Voice e fihle <goalPercentage></goalPercentage> ya letšatši le letšatši ya { $goalValue } pakane ya go gatiša.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
nso: O thušitše Common Voice e fihle <goalPercentage></goalPercentage> ya letšatši le letšatši ya{ $goalValue } pakane ya go gatiša.

source: You've successfully signed up for contributing to { $language }. Thank you.
nso: O ngwaditšitše ka katlego go neela ka { $language }. Rea leboga.

source: Zip #{ $offset } of { $total }
nso: Zip #{ $offset } tša { $total }

source: Zulu
nso: SeZulu
